#+title: 知识

*** TODO [#B] （控件）与底层网络事件交互
SCHEDULED: <2022-12-08 Thu>
:LOGBOOK:
CLOCK: [2022-10-27 Thu 08:44]--[2022-10-27 Thu 08:52] =>  0:08
CLOCK: [2022-10-26 Wed 21:18]--[2022-10-26 Wed 21:50] =>  0:32
CLOCK: [2022-10-26 Wed 19:37]--[2022-10-26 Wed 20:40] =>  1:03
CLOCK: [2022-10-26 Wed 17:14]--[2022-10-26 Wed 18:02] =>  0:48
CLOCK: [2022-10-26 Wed 16:30]--[2022-10-26 Wed 17:11] =>  0:41
CLOCK: [2022-10-26 Wed 14:48]--[2022-10-26 Wed 16:22] =>  1:34
CLOCK: [2022-10-24 Mon 22:11]--[2022-10-24 Mon 22:34] =>  0:23
CLOCK: [2022-10-24 Mon 20:07]--[2022-10-24 Mon 20:48] =>  0:41
:END:
- [-] 书本内容总结
    - [-] 多线程的通信
        - [X] UI 和 service 的异步通信
            - [X] Looper
            - [X] MessageQueue
            - [X] Message
            - [X] Handler
        - [ ] AsyncTask
    - [X] 启动 service
      纠正一个错误的误区，那就是 service 并不是开一个多线程，而是在主线程。只有在耗时任务的时候，需要用户手动开启多线程
        - 主要是两部
            1. 生命周期
            2. 连接
        - [X] 步骤
            1. 通过 Intent 绑定 service 和 activity
            2. 给全局的函数传递 intent
            3. 然后调用 service 的回调函数
        其中 *连接* 的比较复杂，需要把传入一个匿名对象去接收 service 回调返回的结果，然后调用该匿名对象的回调函数
        这样就可以在 activity 传入的匿名对象操作 service 回调返回的对象。这样实现了通信
        - [X] 详细过程
            - [X] 创建，启动，删除
              #+begin_src kotlin
                class MyService : Service {
                    fun onCreate() { }
                    fun onDestory() { }
                    fun onStart() { }
                }
                class MainActivity  {
                    fun onCreate() {
                        val intent : Intent(this, MyService::class.java)
                        startService(intent)	//开启服务
                    }
                }
              #+end_src
            - [X] 绑定 activity 和 Service
              #+begin_src kotlin
                class MyService {
                    private val mbind = DownloadBinder()

                    class DownloadBinder : Binder() {
                        fun startDownload() {}
                        fun getProgress() {}
                    }

                    override fun onBind(intent : Intent) : IBind {
                        return mbind
                    }
                }

                class MainActivity {
                    // 重写 onServiceConnected 和 onServiceDisconnected
                    // 应该是写要求 service 做的事情
                    private val obj = object: ServiceConnection {
                        override fun onServiceConnected (name: ComponentName, service: IBinder) {
                            val mbind = service as MyService.MyDownload
                            mbind.startDownload()
                            mbind.getProgress()
                        }
                    }

                    override fun onCreate() {
                        val intent = Intent(this, MyService::java.class)
                        // 第二个参数：传入一个 handler 匿名对象，要求重写
                        // OnServiceConnected 和 OnServiceDisconnected 方法
                        //
                        // 第三个参数则是一个标志位，这里传入BIND_AUTO_CREATE表示在Activity和Service进行绑定后自动创建Service
                        bingService(intent, obj, BIND_AUTO_CREATE)	//调用 MyService 的绑定回调
                    }
                }
              #+end_src
    - [X] 主要是要处理字符串，任何控件的 text() 方法之类的要关注
    - [ ] 网络库
- [ ] 任务
    - [ ] 监听网络事件，发送到 textView
    - [ ] 把 textView 内容主动发送网络上
*** TODO [#B] 完成一个最小 demo ：简单的 echo-client, 和 Gevent 对接
SCHEDULED: <2022-12-11 Sun>
- State "STOP"       from "STARTED"    [2022-10-24 Mon 19:46] \\
  前置条件，Service 层还没有搞定
- State "STARTED"    from "STOP"       [2022-10-24 Mon 19:01]
- State "STOP"       from "STARTED"    [2022-10-24 Mon 16:16] \\
  已经学习控件之间的交互
:LOGBOOK:
CLOCK: [2022-10-24 Mon 19:01]--[2022-10-24 Mon 19:46] =>  0:45
CLOCK: [2022-10-24 Mon 15:05]--[2022-10-24 Mon 16:16] =>  1:11
CLOCK: [2022-10-24 Mon 14:15]--[2022-10-24 Mon 15:04] =>  0:44
:END:
- [X] 要是不知道怎么去快速浏览 Android SDK 的设计大纲，根本不知道调用什么接口
  Android SDK API 官方网站：https://kotlinlang.org/api/latest/jvm/stdlib/kotlin/-char-sequence/
- [ ] 创建主 acitives
    - [ ] textView1 和 button: 接收用户信息并发送到 service 网络层
        - [ ] 创建 service
        - [ ] TCP 到 echo-server
        - [ ] 主 Activies 和 service 通信
    - [ ] textView2 监听 service 网络，并且显示出来
- [ ] 创建 service
    - [ ] 响应用户 button
    - [ ] 监听 gevent 服务器

*** DONE [#B] python 异步编程的发展史
DEADLINE: <2022-11-08 Tue 16:45> SCHEDULED: <2022-11-08 Tue 16:30>
:LOGBOOK:
CLOCK: [2022-11-08 Tue 16:31]--[2022-11-08 Tue 16:48] =>  0:17
:END:
- [X] 异步回调时代
  可以追溯到 python2
    - [X] swisted
    - [X] tongo
- [X] 协程时代
  : Python 很早就开始大规模使用协程
    - [X] Python 3.4
        - [X] yield 生成器模拟步进 next()
        - [X] Gevent : greenlet 和 libev 结合
          没有内置的同步原语，就是 monkey Patch 替换

    - [X] python 3.5：从标准网络库和原语发展
        - [X] asyncio
        - [X] async/await
          底层是 yield, 所以好好了解下 yield，非常有必要

    - [X] 全面协程化（除了网络）
      社区，借助 async/await 原语，与类似 asyncio 的数据库 io 复用结合，诞生了数据库连接的协程库，

        - [X] aiomysql

        - [X] aiohttp: 进一步封装 asyncio 作为 http 服务器

*** DONE [#A] CYthon 的底层原理 [83%]
DEADLINE: <2022-11-23 Wed 16:00> SCHEDULED: <2022-11-23 Wed 14:00>
:LOGBOOK:
CLOCK: [2022-11-23 Wed 16:15]--[2022-11-23 Wed 17:36] =>  1:21
:END:
-----------------------------------------------------
- [X] 任务目标
  根据 socket 模块的 gethostname 的延伸，为啥标准库 lib/python/ 里面没有 def gethostname 的源代码，不得不想联想到和 c 的关系
-----------------------------------------------------
- [X] https://awesome-programming-books.github.io/python/Python%E6%BA%90%E7%A0%81%E5%89%96%E6%9E%90.pdf
------------------------------------------------------
- [X] Cython gethostname() 解释工作的原理？
  背后有一个 c 函数，Python 解释器去调用 c 函数
- [X] 怎么看 cpython 的解释器源码 / 如何看待 gethostname 对应的 c 代码扩展？
- [X] 到底是特殊的 c 模块翻译成 py? 还是 py 所有语句都翻译成 c 模块
  都不是，而是底层虚拟机根据上层的解析后的 py 代码分词作出指令，而虚拟机是 c 写的，所以当然最后是 c 代码。这里的低效是上层 py 代码的低效，而 c 模块直接调用不需要虚拟机的翻译过程
- [ ] 怎么通过 c 代码扩展 python?

**** DONE 大纲
:LOGBOOK:
CLOCK: [2022-11-11 Fri 08:00]--[2022-11-12 Sat 18:31] => 34:31
:END:
: 为什么是最高优先级，因为我看文档比看任何垃圾博客，看任何书要高效，对程序员的锻炼更好，王勇大哥就是这样进步来的。
: 不是要过面试吗？看什么书都不如看官方文档，所以最高优先级给到官方文档
-----------------------------------------------------
- [X] 任务目标
  全方位的学习 Python
-----------------------------------------------------
- [X] https://docs.python.org/zh-cn/3/contents.html
- [X] [[~/code/python教材/]]
------------------------------------------------------
**** DONE [#A] 数据结构 [90%]
SCHEDULED: <2022-11-20 23:00> DEADLINE: <2022-11-20 23:59>
:LOGBOOK:
CLOCK: [2022-11-21 Mon 14:20]--[2022-11-21 Mon 14:49] =>  0:29
CLOCK: [2022-11-21 Mon 13:00]--[2022-11-21 Mon 13:45] =>  0:45
CLOCK: [2022-11-21 Mon 11:40]--[2022-11-21 Mon 12:10] =>  0:30
CLOCK: [2022-11-21 Mon 08:32]--[2022-11-21 Mon 10:29] =>  1:57
CLOCK: [2022-11-20 Sun 23:00]--[2022-11-20 Sun 23:51] =>  0:51
:END:
--------------------------------------------------------------
- [X] 任务目标
  学会内置的数据结构
--------------------------------------------------------------
- [X] https://docs.python.org/zh-cn/3/tutorial/datastructures.html#using-lists-as-stacks
- [X] [[~/code/python教材/数据结构/]]
--------------------------------------------------------------
: 都是高级的数据结构，没有数组，链表等底层的数据结构，例如列表，虽然相当于 std::vector, 但是允许甚至鼓励像 std::list 一样进行中间删除，虽然效率很低。
- [X] 列表：（泛型）
  : 异常很重要，因为异常相当于接口的健壮性。像 c++ 那种奇葩，竟然为了性能连异常都不用，那还叫编程语言？？？
    - [X] 可迭代对象
      num = list(123) 错误代码
      抛出异常，int object is not iterable 
    - [X] 功能接口
        - [X] Add
            - [X] Append
            - [X] Insert
        - [X] Del
            - [X] Pop( 下标)
                - [X] 有返回值
                - [X] 异常（考虑接口使用错误的情况）
                    - [X] IndexError ：参数（下标）超过范围
                    - [X] TypeError ：参数类型错误
                    - [X] ValueError: 参数传递正确，但是逻辑功能错误。：列表里没有这个元素，暂时不会触发（没有机会），
            - [X] Remove （直接移除元素）
                - [X] 无返回值
                - [X] 移除第一个匹配的元素
                - [X] 异常
                    - [X] 触发 valueError
        - [X] 下标索引 / 切片
          [:] 等同于深拷贝 copy
        - [X] 算法
            - [X] Copy
            - [X] Sort
            - [X] Reverse
            - [X] Count: 获取数量
            - [X] Index 根据元素获取索引
                - [X] 异常
                    - [X] ValueError: 'value' not in list
    - [X] 练习
        - [X] 模拟栈
        - [X] 模拟队列
    - [X] 列表推导式
        - [X] 嵌套的列表推导式
    - [X] Del
      比 pop 更加强大，和切片一样  
      无返回值
- [X] 队列：from collections import deque
  : 双向队列
  可以从 popleft() 和 pop() 。
  列表
- [X] 元祖与序列
    - [X] 初始化方法
        - [X] 普通
            - [X] 直接用逗号
            - [X] 推荐使用 (）
        - [X] 空元素：空括号
        - [X] 只有一个元素的逗号法
          不用扩号也行，但是一定要有 ,号
    - [X] 不可变嵌套可变
      #+begin_src python
        a = (1, [1, 2, 3], 3)
        a[1] = [1,2]                    # TypeError
        a[1][1] = '阿布'                # 正确
      #+end_src
- [-] 集合：
    - [-] 创建
        - [X] set
        - [X] {}
        - [ ] 支持列表推导式
    - [X] 功能接口
        - [X] 支持数学符号运算
- [X] 字典
    - [X] 创建
        - [X] 列表推导式
        - [X] Dict
        - [X] {}
    - [X] 功能接口
        - [X] Del
- [X] 配合使用的几种非常 nice 的循环写法
    - [X] items
      配合迭代取字典的 k,v
    - [X] reverses: 
    - [X] enumerate
    - [X] zip: 两个序列的元素匹配
    - [X] sorted
- [X] 序列比较
    - [X] 相同类型：可以
    - [X] 不同类型：无法比较
    - 
**** STARTED [#A] Socket 模块 [66%]
SCHEDULED: <2022-11-22 Tue 20:40>
:LOGBOOK:
CLOCK: [2022-11-26 Sat 08:43]
CLOCK: [2022-11-24 Thu 07:39]--[2022-11-24 Thu 10:20] =>  2:41
CLOCK: [2022-11-23 Wed 07:56]--[2022-11-23 Wed 09:12] =>  1:16
CLOCK: [2022-11-22 Tue 23:31]--[2022-11-23 Wed 00:19] =>  0:48
CLOCK: [2022-11-22 Tue 21:23]--[2022-11-22 Tue 22:02] =>  0:39
:END:
--------------------------------------------------------------
- [X] 任务目标
  学会内置的网络编程模块
--------------------------------------------------------------
- [X] https://docs.python.org/zh-cn/3/library/ipc.html
- [X] https://docs.python.org/zh-cn/3/library/socket.html
- [X] https://docs.python.org/zh-cn/3/library/socketserver.html#module-socketserver
- [X] [[~/code/python教材/网络编程/]]
--------------------------------------------------------------
- [X] Socket(lib/socket.py)  模块讲解
    - [X] class
        - [X] 套接字类 Socket()
            - [X] 功能函数
                - [X] accept
                - [X] connect
                - [X] bind
                - [X] listen
        - [X] 异常类
            - [X] socket.herror
    - [X] 全局功能函数
        - [X] socket.ntohs
    - [X] 常量之套接字属性
        - [X] 协议族
            - [X] #define AF_INET 1
        - [X] 套接字属性
            - [X] Fork() 后关闭： #define socket_closexe
- [ ] 协议族讲解
- [ ] 网络编程之超时处理
- [ ] socketserver 模块

*** STARTED [#A] 从底层开始阅读那本神书 (为什么交 org-Mode 呢？）
DEADLINE: <2022-12-07 Wed> SCHEDULED: <2022-11-23 Wed>
:LOGBOOK:
CLOCK: [2022-11-24 Thu 12:11]--[2022-11-24 Thu 13:18] =>  1:07
CLOCK: [2022-11-24 Thu 11:16]--[2022-11-24 Thu 11:58] =>  0:42 尝试各种索引代码方法，知道了怎么快速索引 cpython 代码
:END:
-----------------------------------------------------
- [X] 任务目标
  从官方库系统学习后，难道不想彻底深入底层吗？
-----------------------------------------------------
- [X] https://awesome-programming-books.github.io/python/Python%E6%BA%90%E7%A0%81%E5%89%96%E6%9E%90.pdf
- [X] [[~/code/python源码]]
------------------------------------------------------
- 解释器，虚拟机，总之就是要快，我对 org-mode 有自己的理解，我要创建一个 queue-mode.
- [X] 重点放在虚拟机如何解释 python 字节码上，而不是分词，AST 等编译过程
- [ ] 虚拟机：
  : 直接执行 c 模块代码或翻译 python 代码
- [ ] 内建对象
  : 在 py 上，一切都是对象，就连类本身也是个对象，那么 python 的内建对象是如何用 c 来表示的呢？
    - [ ] Python 层面的内建对象，如何映射到 c 上


**** DONE [#B] aiohttp 大纲
SCHEDULED: <2022-11-08 Tue 15:45> DEADLINE: <2022-11-10 Thu 22:59>
:LOGBOOK:
CLOCK: [2022-11-10 Thu 20:04]--[2022-11-10 Thu 21:34] =>  1:30
CLOCK: [2022-11-08 Tue 18:35]--[2022-11-08 Tue 19:02] =>  0:27
CLOCK: [2022-11-08 Tue 15:58]--[2022-11-08 Tue 16:30] =>  0:32
CLOCK: [2022-11-07 Mon 21:48]--[2022-11-07 Mon 22:31] =>  0:43
CLOCK: [2022-11-05 Sat 23:04]--[2022-11-06 Sun 00:02] =>  0:58
:END:
- [X] 任务目标
  既然是使用 Aio 封装一个 Http 服务器，刚好搞不懂
    1. Await 和 Asyncio 的关系
    2. Python 的协程运作原理
- [X] 延伸
    - [X] 我想把这个项目搞懂
    - [X] 通过查找 await with 定义时发现官方网站，决定把文档看一遍，来学习 Python
.............................................................
- [X] Readme.md 阅读，非常重要！！！ (等于是大纲了解）
  : 从这里开始，以后阅读源码的 todo 任务，第一件事情是阅读 readme
  : 看官方文档，比看那些垃圾教材好 10000 倍啊。
    - [X] Readme.rst
        - [X] 先入个门
            - [X] 特性介绍
                - [X] connection socket
                - [X] http 
                - [X] web server route
            - [X] 官方例子
                - [X] 包：asyncio
                  我懂了， Golang 的协程是内置的，所以不论网络，数据库皆可以借助协程构建
                  而 python 借助第三方库需要满足两个条件
                    - [X] 配合抢占式的原语
                        - [X] async
                        - [X] async with
                        - [X] await
                    - [X] 底层驱动的 io 复用
                        - [X] 数据库封装
                        - [X] 网络库封装：
                            - [X] 标准的 io 复用网络库 就是 asyncio
                - [X] 关键字
                    - [X] async：作为协程
                    - [X] async with
                    - [X] await：从函数中间让出 cpu, 等协程底层的 LOOP Wait
                - [X] 业务逻辑
                    - [X] 先跑起来
                      跑不起来，因为没有被
        - [X] Document： 在线文档链接。可以说是官方网站，信息量非常大，要多看
          https://docs.aiohttp.org/en/stable/
        - [X] BenchMarks
        - [X] 其他无用
            - [X] License
            - [X] 交流群
    - [X] Demo/readme.rst: 没啥用
    - [X] poll/readme.ret: 没啥用
- [X] 功能描述
  像 nginx 的 http-server
- [X] 模块拆解
    - [X] Http 协议处理
    - [X] Web Server 路由功能（导入 web 应用服务器）


*** STARTED [#B] Python 常见编程手法（最佳实践）
DEADLINE: <2022-11-11 Thu 11:55>
:LOGBOOK:
CLOCK: [2022-11-05 Sat 21:10]--[2022-11-05 Sat 21:38] =>  0:28
CLOCK: [2022-11-05 Sat 20:25]--[2022-11-05 Sat 21:04] =>  0:39
CLOCK: [2022-11-05 Sat 18:00]--[2022-11-05 Sat 19:00] =>  1:00
CLOCK: [2022-11-05 Sat 16:08]--[2022-11-05 Sat 17:00] =>  0:52
CLOCK: [2022-11-05 Sat 15:26]--[2022-11-05 Sat 16:05] =>  0:39
CLOCK: [2022-11-05 Sat 15:21]--[2022-11-05 Sat 15:26] =>  0:05
:END:
- [-] 从灵剑的知乎答案汲取之设计
    - [X] 动态语言 Duck 类型的好处
      : 总结起来就是扩展与修改方便，以及抽象程度高，所以代码精简，表达能力强
        - [X] 代码精简
          用到就是 interface, 反之不是。

          不用手动写 interface, 避免了像 java 一样，即使只有一个子类，也要为其创建 interface ，导致代码臃肿

          一个普通函数，就能多态（类似于 c++ 的模板静态多态）

        - [X] 逻辑变更时，优势巨大

            - [X] 例子1：上层不变，底层迁移
              在静态语言中，如果底层没有架构好依赖倒置原则，上层依赖具体底层实现。

              例如直接调用 tcpserver, 要换成 udp, 基本 gg

              但是对于动态语言来说，只要新的底层模块和原来的使用一样的接口，上层就可以无感升级。

              *因为 duck 类型天生就是接口，天生符合依赖倒置原则。*

            - [X] 例子2:模块迁移
              把类从 a 模块迁移到 b 模块，只要 mv 过去就行，因为不依赖具体实现，参数全是抽象接口
              当然调用方要改变包的路径

    - [X] Python 良好的设计模式

        - [X] 设计模式的几大原则必须遵循

        - [X] Duck 函数调用
          : 因为函数参数就是一个接口，所以需要统一调用方和接收方

            - [X] 接口设计方

                - [X] 传递基础类型
                  例如内置数据结构，以及贯穿项目的基础类型，如 Loop 等

                - [X] 内部不能直接修改参数
                  要修改时，通过深拷贝修改，然后返回结果，这样调用方能假定传入的对象不会被修改而担心副作用

            - [X] 调用方
                - [X] 知道具体业务

                - [X] 主要通过文档，知道具体功能，而不是看源码
                    1. [X] 假定接口内部不会对参数修改，则不用担心传入的对象的副作用

                    2. [X] 具有多态性

    - [ ] Python 是怎么废掉 java 的设计模式的

- [ ] 函数内部设计
    - [ ] 参数
        - [ ] 业务对象
          每个对象都是可以多态的接口，那么函数怎么处理这些对象呢？

            - [ ] 源码索引
                - [ ] 找到调用点的地方，多次对比调用方
                - [ ] 详细阅读函数定义

        - [ ] args 和 kwargs

*** STARTED [#B] python 设计模式
DEADLINE: <2022-11-13 Sun>
:LOGBOOK:
CLOCK: [2022-11-05 Sat 14:25]--[2022-11-05 Sat 15:26] =>  1:01
CLOCK: [2022-11-05 Sat 08:06]--[2022-11-05 Sat 12:29] =>  4:23
:END:

https://weread.qq.com/web/reader/e5c328107159b28fe5c8d02kc1632f5021fc16a5320f3dc
- [-] 设计模式理论知识

    - [ ] Python 鸭子类型
      所以的类型都是抽象接口（抽象基类），用到就是接口，没有用到就不是

    - [X] 原则

        - [X] 开闭原则
          : 精髓部分
          用户发布的库，对外接口的类 / function 扩展开发，但是对于修改关闭。
          什么意思呢？就是说接口可以扩展功能的同时，不能修改接口类实现
          *这就意味模块的对外接口一定是个抽象基类*
          好处：
            - 保持代码的向前兼容
              例如各大网络库的的接口一经发布，就要考虑修改后能否兼容以前的旧版本，它的用户 server 能否升级后使用新功能，而不会出现旧的调用口被破坏的情况。

        - [X] 依赖倒置原则
          不应该依赖与具体类的实现，而是依赖于抽象类，不同模块之间的通过抽象类来耦合

        - [X] 替换原则
          子类可以替换抽象基类

        - [X] 单一职责原则
          每个类都有明确的功能划分

        - [X] 接口隔离原则

    - [-] 设计模式理解与用途

        - [-] 创建型设计模式        :对象的创建

            - [X] 单例模式
              确保只有一个类的对象被创建，并且提供程序全局访问，防止资源被竞争，例如 logger 对象，就是一个单例模式

            - [ ] 工厂模式
              一个 final 类，静态函数根据不同的条件，返回基类的不同子类，所以叫做工厂

              #+begin_src java
                public class MqttMessage { }	// 抽象

                // 具体子类
                public class MqttPublishMessage extends MqttMessage {}
                public class MqttSubAckMessage extends MqttMessage {}

                // 工厂
                public final class MqttMessageFactory {
                    public static MqttMessage newMessage(MqttMessageHeader header) {
                        switch (header.type()):
                            case PUBLISH:
                              return new MqttPublishMessage(xxoo);
                    }
                }
              #+end_src

                - [ ] 简单工厂

                - [ ] 工厂方法

                - [ ] 抽象工厂

        - [ ] 结构型设计模式        :类和对象之间的关系：组合和继承
        - [ ] 行为型设计模式        :对象的交互

- [-] Python 实现设计模式
    - [-] 单例模式
        - [X] 实现方法
            - [X] 普通模式
              #+begin_src python
                 class Singaton(Logger):
                     def __new__(cls):
                         if not hasattr(cls, "fuckyou"):
                             cls.fuckyou = super(Singaton, cls).__new__(cls)

                         return cls.fuckyou


                s = Singaton()
                print("object created", s)

                s1 = Singaton()
                print('ojbect1 created", s1)

              #+end_src

            - [X] 懒汉化实现 /（又名通过静态方法 getInstance 创建）
              类有一个静态 instance 指针，只有通过 getInstance 才能 new 该指针，否则 new 无数个对象该指针也是 None
              #+begin_src python
                class Logger:
                    __instance = None
                    def __init__(self):
                        if not __instance:
                            print('not create __instance')
                        else:
                            print('create __instance')


                    def getInstance(cls):
                        __instance = Logger(cls)
                        return __instance

              #+end_src

            - [X] 元类的单例模式

        - [-] 实战应用
            - [X] 数据库应用

                - [X] 为什么数据库应用要用到单例模式？
                  因为一个 web 服务，数据库是作为一个共享资源，不同模块都会对数据库进行读写。

                  所以，即使多次实例化对象，但是实际使用的是同一个数据库实例，能够同步访问，避免竞争条件

                - [X] 尝试封装 Database
                  通过元类保存各个单例类的 instance 指针，虽然这里只有一个 Database 是单例类

                    #+begin_src python
                      import sqlite3

                      class MetaSingleton(type):
                          __instances = {}            # 数组
                          def __call__(cls, *args, **kwards):
                              if cls not in __instances:
                                  cls.__instances[cls] = super(MetaSingleton, cls).__call__(args, kwargs)

                          return cls.__instances[cls]
                      ...

                      class Database(metaclass=MetaSingleton):
                          connection = None
                          def connect(self):
                              if self.connection is None:
                                  self.connection = sqlite3.connect()
                                  self.cursor = self.connection.cursor()
                          return self.cursor

                      db1 = Database().connect()
                      db2 = Database().connect()

                    #+end_src

            - [ ] 监控程序
              https://weread.qq.com/web/reader/e5c328107159b28fe5c8d02k182326e0221182be0c5ca23

    - [X]  MonoState 单态模式
      和单例模式不同，每个对象是独立的，但是所有的对象功能共享所有的状态
      在 python 中，可以通过给__dict__ 赋值一个静态变量实现。
      .__dict__ 用来存储对象的状态，给他赋值的静态变量，意思是所有对象共享状态的意思。
      #+begin_src python
        class Logger:
            __shared_var = {}
            def __init__(self):
                self.__dict__ = self.__shared_var
                self.x = 1

        a = Logger()
        b = Logger()
        a.x = 3
        print(b.x)                      # 改变对象 a 的 x 值，对象 b 的 x 值也会改变

      #+end_src

    - [ ] 工厂方法

        - [ ] 实现方法

        - [ ] 实战应用


*** DONE [#E] 模块化 gtd 任务，将其自然分类，减轻负担
DEADLINE: <2022-10-22 Sat 09:30>
:LOGBOOK:
CLOCK: [2022-10-22 Sat 15:04]--[2022-10-22 Sat 15:05] =>  0:01
:END:

